# PANDAS DATAFRAME OLUSTURMAK

In [1]:
import pandas as pd

In [2]:
seri = pd.Series([1,2,3,4,5])

In [4]:
pd.DataFrame(seri, columns=["degisken_ismi"])

   degisken_ismi
0              1
1              2
2              3
3              4
4              5

In [7]:
import numpy as np
m = np.arange(1,10).reshape((3,3))
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [8]:
pd.DataFrame(m, columns=["var1","var2","var3"])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [9]:
#df isimlendirme

In [10]:
df = pd.DataFrame(m, columns=["var1","var2","var3"])

In [11]:
df

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [12]:
df.head()

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [16]:
df.columns = ("deg1","deg2","deg3")

In [17]:
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [18]:
type(df)

pandas.core.frame.DataFrame

In [19]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['deg1', 'deg2', 'deg3'], dtype='object')]

In [20]:
df.shape

(3, 3)

In [21]:
df.ndim #boyut bilgisini gosterir

2

In [22]:
df.size #eleman sayisini verir

9

In [24]:
df.values #numpy array formatina cevirip degerleri gosterdi

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [25]:
type(df.values)

numpy.ndarray

In [27]:
df.tail(1)

   deg1  deg2  deg3
2     7     8     9

In [28]:
a = np.array([1,2,3,4,5])

In [29]:
a

array([1, 2, 3, 4, 5])

In [30]:
pd.DataFrame(a, columns=["yeni"])

   yeni
0     1
1     2
2     3
3     4
4     5